### [1/1] build [bigw-terraform-azure-app-insights-web-tests - 20221106.1](https://dev.azure.com/bigw-azure-devops-poc//platform/_build/results?buildId=115716&view=results)%0D%0ATerraform produced the following plan:%0D%0A* test name: TestBigWAzAppInsightsAsAppInsightWebTestsDefault%0D%0A```diff%0D%0A%0D%0ATerraform will perform the following actions:%0D%0A%0D%0A@@# module.app_insights.data.azurerm_key_vault.main[0] will be read during apply @@                                                         %0D%0A  # (config refers to values not yet known)%0D%0A <= data "azurerm_key_vault" "main"  {%0D%0A+     + access_policy                   = (known after apply)                                                                               %0D%0A+     + enable_rbac_authorization       = (known after apply)                                                                               %0D%0A+     + enabled_for_deployment          = (known after apply)                                                                               %0D%0A+     + enabled_for_disk_encryption     = (known after apply)                                                                               %0D%0A+     + enabled_for_template_deployment = (known after apply)                                                                               %0D%0A+     + id                              = (known after apply)                                                                               %0D%0A+     + location                        = (known after apply)                                                                               %0D%0A+     + name                            = "bigw-kv-dev-aae-terratst"                                                                        %0D%0A+     + network_acls                    = (known after apply)                                                                               %0D%0A+     + public_network_access_enabled   = (known after apply)                                                                               %0D%0A+     + purge_protection_enabled        = (known after apply)                                                                               %0D%0A+     + resource_group_name             = "bigw-rg-dev-aae-terratest-landing"                                                               %0D%0A+     + sku_name                        = (known after apply)                                                                               %0D%0A+     + tags                            = (known after apply)                                                                               %0D%0A+     + tenant_id                       = (known after apply)                                                                               %0D%0A+     + vault_uri                       = (known after apply)                                                                               %0D%0A%0D%0A+     + timeouts {                                                                                                                          %0D%0A+         + read = (known after apply)                                                                                                      %0D%0A+       }                                                                                                                                   %0D%0A    }%0D%0A%0D%0A@@# module.app_insights.azurerm_application_insights.main["terratest-app-insights-Oe16ix"] will be created @@                               %0D%0A@@  + resource "azurerm_application_insights" "main" { @@                                                                                   %0D%0A+     + app_id                                = (known after apply)                                                                         %0D%0A+     + application_type                      = "web"                                                                                       %0D%0A+     + connection_string                     = (sensitive value)                                                                           %0D%0A+     + daily_data_cap_in_gb                  = (known after apply)                                                                         %0D%0A+     + daily_data_cap_notifications_disabled = (known after apply)                                                                         %0D%0A+     + disable_ip_masking                    = false                                                                                       %0D%0A+     + force_customer_storage_for_profiler   = false                                                                                       %0D%0A+     + id                                    = (known after apply)                                                                         %0D%0A+     + instrumentation_key                   = (sensitive value)                                                                           %0D%0A+     + internet_ingestion_enabled            = true                                                                                        %0D%0A+     + internet_query_enabled                = true                                                                                        %0D%0A+     + local_authentication_disabled         = false                                                                                       %0D%0A+     + location                              = "australiaeast"                                                                             %0D%0A+     + name                                  = "terratest-app-insights-Oe16ix"                                                             %0D%0A+     + resource_group_name                   = "terratest-rg-Oe16ix"                                                                       %0D%0A+     + retention_in_days                     = 30                                                                                          %0D%0A+     + sampling_percentage                   = 100                                                                                         %0D%0A+     + tags                                  = {                                                                                           %0D%0A+         + "Application" = "'tbc'"                                                                                                         %0D%0A+         + "CostCentre"  = "634"                                                                                                           %0D%0A+         + "Environment" = "'tbc'"                                                                                                         %0D%0A+         + "ManagedBy"   = "'tbc'"                                                                                                         %0D%0A+         + "Owner"       = "'tbc'"                                                                                                         %0D%0A+         + "Support"     = "'tbc'"                                                                                                         %0D%0A+       }                                                                                                                                   %0D%0A    }%0D%0A%0D%0A@@# module.app_insights.azurerm_key_vault_secret.app_id["terratest-app-insights-Oe16ix"] will be created @@                                 %0D%0A@@  + resource "azurerm_key_vault_secret" "app_id" { @@                                                                                     %0D%0A+     + id                      = (known after apply)                                                                                       %0D%0A+     + key_vault_id            = (known after apply)                                                                                       %0D%0A+     + name                    = "TERRATEST-APP-INSIGHTS-OE16IX--APP-ID"                                                                   %0D%0A+     + resource_id             = (known after apply)                                                                                       %0D%0A+     + resource_versionless_id = (known after apply)                                                                                       %0D%0A+     + value                   = (sensitive value)                                                                                         %0D%0A+     + version                 = (known after apply)                                                                                       %0D%0A+     + versionless_id          = (known after apply)                                                                                       %0D%0A+   }                                                                                                                                       %0D%0A%0D%0A@@# module.app_insights.azurerm_key_vault_secret.connection_string["terratest-app-insights-Oe16ix"] will be created @@                      %0D%0A@@  + resource "azurerm_key_vault_secret" "connection_string" { @@                                                                          %0D%0A+     + id                      = (known after apply)                                                                                       %0D%0A+     + key_vault_id            = (known after apply)                                                                                       %0D%0A+     + name                    = "TERRATEST-APP-INSIGHTS-OE16IX--CONNECTION-STRING"                                                        %0D%0A+     + resource_id             = (known after apply)                                                                                       %0D%0A+     + resource_versionless_id = (known after apply)                                                                                       %0D%0A+     + value                   = (sensitive value)                                                                                         %0D%0A+     + version                 = (known after apply)                                                                                       %0D%0A+     + versionless_id          = (known after apply)                                                                                       %0D%0A+   }                                                                                                                                       %0D%0A%0D%0A@@# module.app_insights.azurerm_key_vault_secret.instrumentation_key["terratest-app-insights-Oe16ix"] will be created @@                    %0D%0A@@  + resource "azurerm_key_vault_secret" "instrumentation_key" { @@                                                                        %0D%0A+     + id                      = (known after apply)                                                                                       %0D%0A+     + key_vault_id            = (known after apply)                                                                                       %0D%0A+     + name                    = "TERRATEST-APP-INSIGHTS-OE16IX--INSTRUMENTATION-KEY"                                                      %0D%0A+     + resource_id             = (known after apply)                                                                                       %0D%0A+     + resource_versionless_id = (known after apply)                                                                                       %0D%0A+     + value                   = (sensitive value)                                                                                         %0D%0A+     + version                 = (known after apply)                                                                                       %0D%0A+     + versionless_id          = (known after apply)                                                                                       %0D%0A+   }                                                                                                                                       %0D%0A%0D%0A@@# module.main.data.azurerm_application_insights.main["terratest-app-insights-Oe16ix"] will be read during apply @@                        %0D%0A  # (config refers to values not yet known)%0D%0A <= data "azurerm_application_insights" "main"  {%0D%0A+     + app_id              = (known after apply)                                                                                           %0D%0A+     + application_type    = (known after apply)                                                                                           %0D%0A+     + connection_string   = (sensitive value)                                                                                             %0D%0A+     + id                  = (known after apply)                                                                                           %0D%0A+     + instrumentation_key = (known after apply)                                                                                           %0D%0A+     + location            = (known after apply)                                                                                           %0D%0A+     + name                = "terratest-app-insights-Oe16ix"                                                                               %0D%0A+     + resource_group_name = "terratest-rg-Oe16ix"                                                                                         %0D%0A+     + retention_in_days   = (known after apply)                                                                                           %0D%0A+     + tags                = (known after apply)                                                                                           %0D%0A+     + workspace_id        = (known after apply)                                                                                           %0D%0A%0D%0A+     + timeouts {                                                                                                                          %0D%0A+         + read = (known after apply)                                                                                                      %0D%0A+       }                                                                                                                                   %0D%0A    }%0D%0A%0D%0A@@# module.main.azurerm_application_insights_web_test.main["terratest-app-insights-Oe16ix--[200] - uptime-test-1-Oe16ix"] will be created @@%0D%0A@@  + resource "azurerm_application_insights_web_test" "main" { @@                                                                          %0D%0A+     + application_insights_id = (known after apply)                                                                                       %0D%0A+     + configuration           = (known after apply)                                                                                       %0D%0A+     + enabled                 = true                                                                                                      %0D%0A+     + frequency               = 300                                                                                                       %0D%0A+     + geo_locations           = [                                                                                                         %0D%0A+         + "emea-au-syd-edge",                                                                                                             %0D%0A+         + "apac-hk-hkn-azr",                                                                                                              %0D%0A+         + "apac-jp-kaw-edge",                                                                                                             %0D%0A+       ]                                                                                                                                   %0D%0A+     + id                      = (known after apply)                                                                                       %0D%0A+     + kind                    = "ping"                                                                                                    %0D%0A+     + location                = "australiaeast"                                                                                           %0D%0A+     + name                    = "[200] - uptime-test-1-Oe16ix"                                                                            %0D%0A+     + resource_group_name     = "terratest-rg-Oe16ix"                                                                                     %0D%0A+     + retry_enabled           = true                                                                                                      %0D%0A+     + synthetic_monitor_id    = (known after apply)                                                                                       %0D%0A+     + tags                    = {                                                                                                         %0D%0A+         + "Application" = "'tbc'"                                                                                                         %0D%0A+         + "CostCentre"  = "634"                                                                                                           %0D%0A+         + "Environment" = "'tbc'"                                                                                                         %0D%0A+         + "ManagedBy"   = "'tbc'"                                                                                                         %0D%0A+         + "Owner"       = "'tbc'"                                                                                                         %0D%0A+         + "Support"     = "'tbc'"                                                                                                         %0D%0A+       }                                                                                                                                   %0D%0A+     + timeout                 = 60                                                                                                        %0D%0A+   }                                                                                                                                       %0D%0A%0D%0A@@# module.main.azurerm_application_insights_web_test.main["terratest-app-insights-Oe16ix--[301] - uptime-test-3-Oe16ix"] will be created @@%0D%0A@@  + resource "azurerm_application_insights_web_test" "main" { @@                                                                          %0D%0A+     + application_insights_id = (known after apply)                                                                                       %0D%0A+     + configuration           = (known after apply)                                                                                       %0D%0A+     + enabled                 = true                                                                                                      %0D%0A+     + frequency               = 300                                                                                                       %0D%0A+     + geo_locations           = [                                                                                                         %0D%0A+         + "emea-au-syd-edge",                                                                                                             %0D%0A+         + "apac-hk-hkn-azr",                                                                                                              %0D%0A+         + "apac-jp-kaw-edge",                                                                                                             %0D%0A+       ]                                                                                                                                   %0D%0A+     + id                      = (known after apply)                                                                                       %0D%0A+     + kind                    = "ping"                                                                                                    %0D%0A+     + location                = "australiaeast"                                                                                           %0D%0A+     + name                    = "[301] - uptime-test-3-Oe16ix"                                                                            %0D%0A+     + resource_group_name     = "terratest-rg-Oe16ix"                                                                                     %0D%0A+     + retry_enabled           = true                                                                                                      %0D%0A+     + synthetic_monitor_id    = (known after apply)                                                                                       %0D%0A+     + tags                    = {                                                                                                         %0D%0A+         + "Application" = "'tbc'"                                                                                                         %0D%0A+         + "CostCentre"  = "634"                                                                                                           %0D%0A+         + "Environment" = "'tbc'"                                                                                                         %0D%0A+         + "ManagedBy"   = "'tbc'"                                                                                                         %0D%0A+         + "Owner"       = "'tbc'"                                                                                                         %0D%0A+         + "Support"     = "'tbc'"                                                                                                         %0D%0A+       }                                                                                                                                   %0D%0A+     + timeout                 = 60                                                                                                        %0D%0A+   }                                                                                                                                       %0D%0A%0D%0A@@# module.main.azurerm_application_insights_web_test.main["terratest-app-insights-Oe16ix--[404] - uptime-test-2-Oe16ix"] will be created @@%0D%0A@@  + resource "azurerm_application_insights_web_test" "main" { @@                                                                          %0D%0A+     + application_insights_id = (known after apply)                                                                                       %0D%0A+     + configuration           = (known after apply)                                                                                       %0D%0A+     + enabled                 = true                                                                                                      %0D%0A+     + frequency               = 300                                                                                                       %0D%0A+     + geo_locations           = [                                                                                                         %0D%0A+         + "emea-au-syd-edge",                                                                                                             %0D%0A+         + "apac-hk-hkn-azr",                                                                                                              %0D%0A+         + "apac-jp-kaw-edge",                                                                                                             %0D%0A+       ]                                                                                                                                   %0D%0A+     + id                      = (known after apply)                                                                                       %0D%0A+     + kind                    = "ping"                                                                                                    %0D%0A+     + location                = "australiaeast"                                                                                           %0D%0A+     + name                    = "[404] - uptime-test-2-Oe16ix"                                                                            %0D%0A+     + resource_group_name     = "terratest-rg-Oe16ix"                                                                                     %0D%0A+     + retry_enabled           = true                                                                                                      %0D%0A+     + synthetic_monitor_id    = (known after apply)                                                                                       %0D%0A+     + tags                    = {                                                                                                         %0D%0A+         + "Application" = "'tbc'"                                                                                                         %0D%0A+         + "CostCentre"  = "634"                                                                                                           %0D%0A+         + "Environment" = "'tbc'"                                                                                                         %0D%0A+         + "ManagedBy"   = "'tbc'"                                                                                                         %0D%0A+         + "Owner"       = "'tbc'"                                                                                                         %0D%0A+         + "Support"     = "'tbc'"                                                                                                         %0D%0A+       }                                                                                                                                   %0D%0A+     + timeout                 = 60                                                                                                        %0D%0A+   }                                                                                                                                       %0D%0A%0D%0A@@# module.main.random_uuid.main["terratest-app-insights-Oe16ix--[200] - uptime-test-1-Oe16ix"] will be created @@                          %0D%0A@@  + resource "random_uuid" "main" { @@                                                                                                    %0D%0A+     + id      = (known after apply)                                                                                                       %0D%0A+     + keepers = {                                                                                                                         %0D%0A+         + "application_insights_name" = "terratest-app-insights-Oe16ix"                                                                   %0D%0A+         + "name"                      = "[200] - uptime-test-1-Oe16ix"                                                                    %0D%0A+       }                                                                                                                                   %0D%0A+     + result  = (known after apply)                                                                                                       %0D%0A+   }                                                                                                                                       %0D%0A%0D%0A@@# module.main.random_uuid.main["terratest-app-insights-Oe16ix--[301] - uptime-test-3-Oe16ix"] will be created @@                          %0D%0A@@  + resource "random_uuid" "main" { @@                                                                                                    %0D%0A+     + id      = (known after apply)                                                                                                       %0D%0A+     + keepers = {                                                                                                                         %0D%0A+         + "application_insights_name" = "terratest-app-insights-Oe16ix"                                                                   %0D%0A+         + "name"                      = "[301] - uptime-test-3-Oe16ix"                                                                    %0D%0A+       }                                                                                                                                   %0D%0A+     + result  = (known after apply)                                                                                                       %0D%0A+   }                                                                                                                                       %0D%0A%0D%0A@@# module.main.random_uuid.main["terratest-app-insights-Oe16ix--[404] - uptime-test-2-Oe16ix"] will be created @@                          %0D%0A@@  + resource "random_uuid" "main" { @@                                                                                                    %0D%0A+     + id      = (known after apply)                                                                                                       %0D%0A+     + keepers = {                                                                                                                         %0D%0A+         + "application_insights_name" = "terratest-app-insights-Oe16ix"                                                                   %0D%0A+         + "name"                      = "[404] - uptime-test-2-Oe16ix"                                                                    %0D%0A+       }                                                                                                                                   %0D%0A+     + result  = (known after apply)                                                                                                       %0D%0A+   }                                                                                                                                       %0D%0A%0D%0A@@# module.rg.azurerm_resource_group.main will be created @@                                                                                %0D%0A@@  + resource "azurerm_resource_group" "main" { @@                                                                                         %0D%0A+     + id       = (known after apply)                                                                                                      %0D%0A+     + location = "australiaeast"                                                                                                          %0D%0A+     + name     = "terratest-rg-Oe16ix"                                                                                                    %0D%0A+     + tags     = {                                                                                                                        %0D%0A+         + "Application" = "'tbc'"                                                                                                         %0D%0A+         + "CostCentre"  = "634"                                                                                                           %0D%0A+         + "Environment" = "'tbc'"                                                                                                         %0D%0A+         + "ManagedBy"   = "'tbc'"                                                                                                         %0D%0A+         + "Owner"       = "'tbc'"                                                                                                         %0D%0A+         + "Support"     = "'tbc'"                                                                                                         %0D%0A+       }                                                                                                                                   %0D%0A    }%0D%0A%0D%0APlan: 11 to add, 0 to change, 0 to destroy.%0D%0A```